{"video_id": "2gv6mToyztM", "transcript": "Hi, I'm Zoe and I'm going to be exploring the enhanced support available at our libraries. Students with a disability support plan can access additional resources and spaces in libraries, including assistive technology and enhanced support rooms. These are specially dedicated spaces that cater to your individual needs. They are bookable spaces located in quieter parts of the library where there's less distraction so it's much easier to focus. They also contain resources and equipment that can assist you with your studying needs, including dimmable light switches, screen readers, ergonomic equipment such as mice, keyboards and chairs. Equipment may vary depending on the library, but you can find more information on our enhanced support page. Assistive technology and enhanced support rooms are available in Hallwood Library under University Park, George Green Library under University Park, Greenfield Medical Library, Medical School, Jackson Learning Resource Centre, Jubilee Campus, James Cameron Gifford library, Sutton, Boddington enhanced support rooms are also available for more flexible use such as a downtime from studies or a calm space to focus. Assistive technology and enhanced support rooms can be booked for up to 6 hours a day and you can make a booking up to one week in advance. Bookings are quick and simple. Just head down to click and study. Select assistive technology and enhanced support rooms from the drop down menu and you can navigate through each room to make a booking at a time that suits you. Enhanced library support also provides access to useful services. This includes an extended book collection period when using click and collect, so you have up to seven days to collect your requested books from the library. You'll also have access to our alternative format service and can request standard text to be translated into large print, braille, audio and screen reader compatible files. The most important aspect of the enhanced library support is the friendly and knowledgeable library staff who are here to help. They can support you when using library services, including searching the catalogue, finding books, or using library facilities. Library staff can be reached in many ways, including live chat, email, the library helpline, or in person at the reception desk. Contact details can be found on the library webpages and will be available in all assistive technology and enhanced support rooms."}